"""Під час написання цього бота я використовував таку легенду:
Клієнт - мережа ресторанів, яка працює в 5 різних локаціях та хоче
отримати звіт про рівень задоволення клієнтів кожної локації за 5 категоріями:
якість їжі, сервіс, атмосферу у закладі, меню та чистоту.
Після отримання коментарів від користувача бот узагалнює їх та формує звіт.
Сформований звіт відправляється менеджеру закладу у вигляді текстового повідомлення(для спрощення
звіт відправляється тому користувачу, який залишав коментарі).
Паралельно звіт зберігається у базі даних для подальшого аналізу та використання."""


from loader import dp, executor
from handlers import commands, check_list


if __name__ == "__main__":
    executor.start_polling(dp)
